// Пользователь вводит с клавиатуры M чисел
// Посчитайте, сколько чисел больше 0 ввел пользователь



Console.WriteLine("Введите последовательность чисел через пробел");
array int[] = 
